import os
from os import getenv

from pyrogram import filters
from dotenv import load_dotenv

load_dotenv()

# -------------------------------------------------------------
API_ID=25742938 #ʏᴏᴜʀ ᴀᴘɪ ɪᴅ
# -------------------------------------------------------------
API_HASH="b35b715fe8dc0a58e8048988286fc5b6" #ʏᴏᴜʀ ᴀᴘɪ ʜᴀsʜ ɪᴅ
# -------------------------------------------------------------
BOT_TOKEN="7661215745:AAHuAOXF4zpKLKM9oIWhF9w74GzGoZNGi-Q" #ʏᴏᴜʀ ʙᴏᴛ ᴛᴏᴋᴇɴ
# -------------------------------------------------------------
SUDO = list(int(i) for i in os.environ.get("SUDO", "443809517").split(" "))
# -------------------------------------------------------------
BOT_ID=6912331609 #ʏᴏᴜʀ ʙᴏᴛ ɪᴅ ( @MissRose_bot) ʜɪɴᴛ ( /id @Superbot)
# -------------------------------------------------------------
BOT_USERNAME="POWERXMUSICBOT" #ʏᴏᴜʀ ʙᴏᴛ ᴜsᴇʀɴᴀᴍᴇ ᴡʜɪᴛᴏᴜᴛ @
# -------------------------------------------------------------
BOT_NAME="MUSIC" # ʏᴏᴜʀ ʙᴏᴛ ɴᴀᴍᴇ
# -------------------------------------------------------------
OWNER_ID =443809517  # ʏᴏᴜʀ ᴏᴡɴᴇʀ ɪᴅ
# -------------------------------------------------------------
